soap-builder/src/test/resources/services/test13/operations/LinkageServiceSOAPBinding/addToSocialGroup.request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:api="http://api.ifyouwannabecool.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <api:addToSocialGroup>
         <groupId>?</groupId>
         <personaId>?</personaId>
      </api:addToSocialGroup>
   </soapenv:Body>
</soapenv:Envelope>