soap-builder/src/test/resources/services/test13/operations/PersonaServiceSOAPBinding/deletePersona.request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:api="http://api.ifyouwannabecool.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <api:deletePersona>
         <personaId>?</personaId>
      </api:deletePersona>
   </soapenv:Body>
</soapenv:Envelope>